{"data": [{"title": "Tesla slams into fire truck, 1 dead. 14th Tesla-with-FSD/emergency vehicle crash", "date": "2023-02-19", "description": "06:59 AM", "location": "A Tesla driver was killed and a passenger was critically injured Saturday when the car plowed into a fire truck that was parked on an East Bay freeway to shield…"},{"title": "Kenya: Land Offices in Awasi Razed By Fierce Inferno", "date": "2023-02-19", "description": "12:58 PM", "location": "[Capital FM] Kisumu -- Land offices at Awasi, Nyando Sub County went up in flames on Saturday evening."},{"title": "Massive Florida dumpster fire endangering children, pregnant women, and the elderly. But enough about Republicans, there's also been a waste facility burning all week [Florida]", "date": "2023-02-18", "description": "03:05 PM", "location": "Massive Florida dumpster fire endangering children, pregnant women, and the elderly. But enough about Republicans, there's also been a waste facility burning all week"},{"title": "Multiple fire departments respond to two fires in Stougton", "date": "2023-02-19", "description": "02:43 AM", "location": "Crews were battling a fire on Wheeler Circle and at a home on Central Street, where a fourth alarm was struck, the Stoughton Fire Department said in a social media post late Saturday afternoon."},{"title": "At least 6 injured in predawn fire at Maryland highrise", "date": "2023-02-18", "description": "07:18 PM", "location": "At least six people were injured -- one critically -- during a fire early Saturday that left some residents trapped on balconies of a highrise apartment building in Silver Spring, Maryland, a fire official says."},{"title": "JUST IN: Property razed as tanker bursts into flames in Ondo", "date": "2023-02-19", "description": "02:24 AM", "location": "Property worth millions of naira were burnt down in Idanre community in Idanre Local Government Area of Ondo State on Saturday evening, when a tanker carrying petrol fell and caught fire. It was gathered that the fire razed down the filling station and a buil…"},{"title": "Plymouth man dies in fire caused by ‘smoking materials,’ officials say", "date": "2023-02-18", "description": "10:02 PM", "location": "The state Fire Marshal is urging people who smoke to “be sure to put it out, all the way, every time” after William J. Price, 79, died in a Plymouth house fire started by “smoking materials” last week."},{"title": "Sheriff: Gunman fatally shot, 2 wounded near barn fire", "date": "2023-02-19", "description": "12:23 AM", "location": "A Florida sheriff’s deputy fatally shot an armed man who had wounded two people and set a barn on fire before barricading himself inside a house"},{"title": "High-rise fire kills 1, displaces 400 residents in DC suburb", "date": "2023-02-19", "description": "07:29 AM", "location": "One person died and one is in critical condition after a fire early Saturday at a high-rise apartment building in a suburb of Washington, D"},{"title": "Tesla driver killed after plowing into firetruck on freeway", "date": "2023-02-19", "description": "05:40 AM", "location": "A Tesla driver was killed and a passenger was critically injured Saturday when the car plowed into a fire truck that was parked on a Northern California..."}]}